Public Member Functions | Static Public Member Functions | List of all members
DG::ColorCatalog Class Reference
Dialog Manager
Provides access to colors for dark mode support. More...
#include <DGColorCatalog.hpp>
 Public Member Functions
ColorCatalog (const ColorCatalog &source)=delete
 ColorCatalog &  | operator= (const ColorCatalog &source)=delete
~ColorCatalog ()=default
Destructor for ColorCatalog.
 Static Public Member Functions
static Gfx::Color  | GetColor (ColorId colorId)
Gets the color (primarily system colors) associated with a given ColorId.
Detailed Description
Provides access to colors for dark mode support.
Member Function Documentation
◆ GetColor()
 static Gfx::Color DG::ColorCatalog::GetColor  |  ( |  ColorId |  colorId | )
static
Gets the color (primarily system colors) associated with a given ColorId.
Parameters
colorId | The identifier of the color.
Returns
The color associated with the given ColorId.